
Задача 1.

Означения
p = вероятност роботът да сглоби дефектен елемент

Хипотези
H0 p = 0.035
H1 p  0.035

За да отговорим на въпроса, използваме следния код
prop.test( x=15, n=500, p=0.035, alternative=less, correct=F )

Извод
p.value = 0.2715  0.05
= не отхвърляме Н0
Нямаме основание да твърдим, че вероятността роботът да сглоби дефектен елемент 
е по-малка от 0.035.


Задача 2.

Означения
X = оценка по Алгебра 1 на случайно избран студент
Y = оценка по Алгебра 2 на случайно избран студент
mu_1 = E(X) = средна оценка по Алгебра 1
mu_2 = E(Y) = средна оценка по Алгебра 2

Хипотези
H0 mu_1 = mu_2
H1 mu_1  mu_2

За да отговорим на въпроса, използваме следния код
t.test( a1, a2, alternative=greater, paired=T )

Верен е първият резултат! 
(Използва се Paired t-test, тъй като извадките са сдвоенизависими.)

Извод
p.value = 1.422e-05  0.05
= отхвърляме Н0
Имаме основание да твърдим, че в средно оценките по Алгебра 1 са по-високи 
от тези по Алгебра 2.


Задача 3.

Означения
X = изминато разстояние до износване на произволна гума от марка 1
Y = изминато разстояние до износване на произволна гума от марка 2
mu_x = E(X) = средно изминато разстояние до износване на гумите от марка 1
mu_y = E(Y) = средно изминато разстояние до износване на гумите от марка 2

Хипотези
H0 mu_x = mu_y
H1 mu_x  mu_y

За да отговорим на въпроса, използваме следния код
t.test( x, y, alternative=greater )

Извод
p.value = 0.04609  0.05
= отхвърляме Н0
Имаме основание да твърдим, че средното изминато разстояние до износване е 
по-голямо при гумите от марка 1 в сравнение с гумите от марка 2.


Задача 4.

а) Напишете оцененото регресионно уравнение. 

модел
grade = beta0 + beta1study.hours + eps

оценено регресионно уравнение
grade.hat = 1.01617 + 0.15806study.hours

б) Интерпретирайте оценения коефициент за предиктора.

Според оцененото регресионно уравнение, при един час повече подготовка за изпита  
оценката е по-висока средно с 0.15806.

в) Може ли да се твърди, че има линейна връзка между оценката 
и часовете, отделени за подготовка

Въпросът се свежда до проверка на хипотезата H0 срещу H1

H0 beta1 = 0
H1 beta1 != 0

p.value = 2.9e-12  0.05 
= отхвърляме Н0
Може да се твърди, че има линейна връзка между оценката и часовете, отделени за
подготовка.

г) Напишете оцененото регресионно уравнение. Интерпретирайте коефициентите 
пред предикторите.

модел
grade = beta0 + beta1study.hours + beta2lectures + eps

оценено регресионно уравнение
grade.hat = 0.54255 + 0.14767study.hours + 0.09432lectures

Според оцененото регресионно уравнение, при един час повече подготовка за изпита  
и фиксиран брой посетени лекции оценката е по-висока средно с 0.14767.

Според оцененото регресионно уравнение, при още една посетена лекция 
и фиксирани часове за подготовка за изпита оценката е по-висока средно с 0.09432.


###